---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.FabricationCannotBeInDesignOption
source: html/eec62d58-9514-5386-eb5e-469b56b4584d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.FabricationCannotBeInDesignOption Property

Structural steel connections or individual structural steel fabrication elements are not allowed in Design Options.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationCannotBeInDesignOption { get; }
```